skybadger/ESP8266_AscomDome/ASCOM_DomeHandler.h
void handleCanSetParkGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CanSetPark", 0, "" );    
    root["Value"] = canSetPark;
    root.printTo(message);
    debugI( "CanSetParkGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;  
}

void handleCanSetShutterGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CanSetShutter", Success, "" );    
    root["Value"] = canSetShutter;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    debugI( "CanSetShutterGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;  
}

void handleCanSlaveGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CanSlave", Success, "" );
    root["Value"] = canSlave;
    root.printTo(message);
    debugI( "CanSlaveGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;  
}

void handleCanSyncAzimuthGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CanSyncAzimuth", Success, "" );    
    root["Value"] = canSyncAzimuth;
    root.printTo(message);
    debugI( "CanSyncAzimuthGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;  
}

//'Slaved' indicates a hardware link between the telescope and dome  - the ASCOM link is not the same. 
void handleSlavedGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    root["Value"] = slaved;
    root.printTo(message);
    debugI( "SlavedGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;  
}

void handleSlavedPut(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();

    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "Slaved", notImplemented, "Not Implemented" );    
    root["Value"] = false;
    root.printTo(message);
    debugI( "SlavedPut: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;  
}

void handleSlewingGet(void)
{
  String message;
  DynamicJsonBuffer jsonBuffer(256);
  JsonObject& root = jsonBuffer.createObject();

  String argsToSearchFor[] = {"clientID","clientTransactionID"};
  uint32_t clientID = 0;
  uint32_t transID = 0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();

  jsonResponseBuilder( root, clientID, transID, ++serverTransID, "Slewing", Success, "" );    
  root["Value"] = ( domeStatus == DOME_SLEWING ) ? true:false;
  root.printTo(message);
  debugI( "SlewingGet: %s", message.c_str() );
  server.send(200, F("application/json"), message);
  return ; 
}

void handleAbortSlewPut(void)
{
  String message;
  DynamicJsonBuffer jsonBuffer(256);
  JsonObject& root = jsonBuffer.createObject();

  String argsToSearchFor[] = {"clientID","clientTransactionID"};
  uint32_t clientID =0;
  uint32_t transID =0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();

  if( connected != clientID )
  {
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "AbortSlew", notConnected, "Client not connected" );
  }
  //01/06/2021 MH commented out  - throwing exception causes conform to get upset. 
  //else if( domeStatus != DOME_SLEWING  )
  //{
  //  jsonResponseBuilder( root, clientID, transID, ++serverTransID, "AbortSlew", invalidOperation, "Not slewing" );       
  //}
  else
  {
    /* Just set status to DOME_ABORT and next top level loop will cause DOME_ABORT processing regardless of contents in 
       command stack. Next command will then be popped. Desirable behaviour ?
       We do 'abort' due to a failed movement, so we could put it to the top of the command stack but unless we 
       continually peek the next command, we wont see it until the current movement you actually want aborted 
       has finished
      //addDomeCmd( clientID, transID, "", CMD_DOME_ABORT, 0 );
    */
    domeStatus = DOME_ABORT;
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "AbortSlew", Success, "" );
  }
  root["value"] = connected; //return the current connected Client ID.
  root.printTo(message);
  debugI( "AbortSlewPut: %s", message.c_str() );    
  server.send(200, F("application/json"), message);
  return ;   
}

