skybadger/ESP8266_AscomDome/ASCOM_DomeHandler.h
void handleShutterStatusGet(void)
{
  String message;
  DynamicJsonBuffer jsonBuffer(256);
  JsonObject& root = jsonBuffer.createObject();

  String argsToSearchFor[] = {"clientID","clientTransactionID"};
  uint32_t clientID =0;
  uint32_t transID =0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();

  //anyone can get the shutter status.
  jsonResponseBuilder( root, clientID, transID, ++serverTransID, "ShutterStatus", Success, "" );
  
  root.set<int>("Value", (int) shutterStatus );
  //root.set<int>("Value", )
  //0 = Open, 1 = Closed, 2 = Opening, 3 = Closing, 4 = Shutter status error
  //JsonArray& offsets = root.createNestedArray("Value");
  root.printTo(message);
  debugI( "ShutterStatusGet: %s", message.c_str() );      
  server.send(200, F("application/json"), message);
  return ;   
}

void handleCloseShutterPut(void)
{
  String message;
  DynamicJsonBuffer jsonBuffer(256);
  JsonObject& root = jsonBuffer.createObject();

  String argsToSearchFor[] = {"clientID","clientTransactionID"};
  uint32_t clientID =0;
  uint32_t transID =0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();

   if( connected != clientID ) 
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CloseShutter", notConnected, "Client not connected" );    
   else if ( shutterStatus == SHUTTER_CLOSED || shutterStatus == SHUTTER_CLOSING )
   { 
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CloseShutter", Success, "" );    
      debugD( "CloseShutterPut: Already closing or closed - skipped. " );              
   }
   else if( shutterStatus == SHUTTER_OPENING || shutterStatus == SHUTTER_OPEN )
   {
      //Set command to close shutter.
      addShutterCmd( clientID, transID, "", CMD_SHUTTER_CLOSE, 0 ); 
      debugD( "CloseShutterPut: Added async command to close" );        
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CloseShutter", Success, "" );    
   }
   else
   {
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CloseShutter", invalidOperation, "Dome shutter not idle or errored" );       
   } 
  
  //JsonArray& offsets = root.createNestedArray("Value");
  root.printTo(message);
  debugI( "CloseShutterPut: %s", message.c_str() );        
  server.send(200, F("application/json"), message);
  return ;   
}

//Kick off the find home operation ???
void handleFindHomePut(void)
{
   String message;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();

   String argsToSearchFor[] = {"clientID","clientTransactionID"};
   uint32_t clientID = 0;
   uint32_t transID = 0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();

   if ( connected != clientID ) 
   {
     jsonResponseBuilder( root, clientID, transID, ++serverTransID, "FindHome", notConnected, "Not connected" );       
   }
   else
   {
      //Set command to move to home.
      addDomeCmd( clientID, transID, "", CMD_DOME_SLEW, homePosition ); 
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "FindHome", Success, "" );
   }
   root.printTo(message);
   debugI( "FindHomePut: %s", message.c_str() );        
   server.send(200, F("application/json"), message);
   return ;   
}

void handleOpenShutterPut(void)
{
   String message;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();

   String argsToSearchFor[] = {"clientID","clientTransactionID"};
   uint32_t clientID = 0;
   uint32_t transID = 0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();
   
   //in this driver model,each device has a separate ip address ,so can only be one device. hence ignore device-number
   if( connected != clientID ) 
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "OpenShutter", notConnected, "Client not connected" );    
   else if ( shutterStatus == SHUTTER_OPEN )
   {
      //We do this becuase the shutter reports open for any state but closed and we may stop it at any point
      //Set command to open shutter.
      addShutterCmd( clientID, transID, "", CMD_SHUTTER_OPEN, 0 );
      debugD( "OpenShutterPut: Already open - requesting anyway. " );        
   }
   else if ( shutterStatus == SHUTTER_OPENING ) 
   {
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "OpenShutter", Success, "" );    
      debugD( "OpenShutterPut: Already opening - ignoring additional request." );            
   }
   else if( shutterStatus == SHUTTER_CLOSING || shutterStatus == SHUTTER_CLOSED )
   {
      //Set command to open shutter.
      addShutterCmd( clientID, transID, "", CMD_SHUTTER_OPEN, 0 );
      debugD( "OpenShutterPut: Added async command to open" );        
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "OpenShutter", Success, "" );    
   }
   else
   {
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, "OpenShutter", invalidOperation, "Dome shutter not idle or errored" );       
   }
   root.printTo(message);
   debugI( "OpenShutterPut: %s", message.c_str() );           
   server.send( 200, F("application/json"), message);
   return ;   
}

//Set park operates when the dome is at the desired park position
/*
 * No argument provided - uses current azimuth and altitude. 
 */
void handleSetParkPut(void)
{
   String message;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();

   String argsToSearchFor[] = {"clientID","clientTransactionID",};
   uint32_t clientID = 0;
   uint32_t transID = 0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();
    
  if( connected != clientID )
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SetPark"), notConnected, "Not connected" );    
  else
  {
    //Set new park location.
    parkPosition = currentAzimuth;
    addDomeCmd( clientID, transID, "parkPosition", CMD_DOMEVAR_SET, parkPosition );      
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SetPark"), Success, "" );    
  }

   root.printTo(message);
   debugI( "SetParkPut: %s", message.c_str() );            
   server.send(200, F("application/json"), message);
   return ;      
}

//ParkPut causes the dome to move to the already stored Park position 
void handleParkPut(void)
{
   String message;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();

   String argsToSearchFor[] = {"clientID","clientTransactionID",};
   uint32_t clientID = 0;
   uint32_t transID = 0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();
    
   addDomeCmd( clientID, transID, "", CMD_DOME_SLEW, parkPosition );      
   jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("Park"), Success, "" );    
   root.printTo(message);
   debugI( "ParkPut: %s", message.c_str() );
   server.send(200, "text/json", message);
   return ;      
}

void handleSlewToAltitudePut(void)
{
   String message;
   float location = 0.0F;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();

   String argsToSearchFor[] = {"clientID","clientTransactionID","altitude"};
   uint32_t clientID = 0;
   uint32_t transID = 0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();
  
